# Task 4.9 - part 1

## This script contains:
#### 01. Task step 3
#### 02. Task step 4
#### 03. Task step 5
#### 04. Task step 6

# 01. Task step 3
## Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# create path to Instacart folder

path = r'/Users/eastongorman/Library/CloudStorage/OneDrive-Personal/Data Analytics/06-2023 Instacart Basket Analysis'

In [3]:
# creating customers dataframe

df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

# 02. Task step 4
## Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [4]:
# check column names

df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# rename columns

df_cust = df_cust.rename(columns = {'First Name':'first_name', 'Surnam':'last_name', 'Gender':'sex', 'STATE':'state', 'n_dependants':'#_dependants', 'fam_status':'marital_status', 'Age':'age'})

In [6]:
# check if column were renamed properly

df_cust.head()

,user_id,first_name,last_name,sex,state,age,date_joined,#_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 03. Task step 5
## Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [7]:
# check descriptive statistics

df_cust.describe()

             user_id            age   #_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# check data types

df_cust.dtypes

user_id            int64
first_name        object
last_name         object
sex               object
state             object
age                int64
date_joined       object
#_dependants       int64
marital_status    object
income             int64
dtype: object

In [9]:
# check for mixed data types

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

## The 'first_name' column has more than one data type

In [10]:
# change 'first_name' column by converting to a string

df_cust['first_name'] = df_cust['first_name'].astype('str')

In [11]:
# check if 'first_name' column was changed to string data type by checking for mixed data types again

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

## There was no columns output, so the data type was changed successfully.

In [12]:
# check for null values

df_cust.isnull().sum()

user_id           0
first_name        0
last_name         0
sex               0
state             0
age               0
date_joined       0
#_dependants      0
marital_status    0
income            0
dtype: int64

## There are no missing values.

In [13]:
# check for full duplicates

df_dups = df_cust[df_cust.duplicated()]

In [14]:
# output

df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, sex, state, age, date_joined, #_dependants, marital_status, income]
Index: []

## There are no duplicates.

# 04. Task step 6
## Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [15]:
# import ords_prods_merge dataset

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_updated_3.pkl'))

In [16]:
# check data types

ords_prods_merge.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
_merge                   category
 price_range_loc           object
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
average_price             float64
spending_flag              object
median_prior_orders       float64
order_frequency_flag       object
dtype: object

In [17]:
# delete merge flag for new merge

del ords_prods_merge['_merge']

In [18]:
# check shape of data

ords_prods_merge.shape

(32404859, 24)

In [19]:
df_cust.shape

(206209, 10)

In [20]:
# merge data sets on user_id

df_merge = df_cust.merge(ords_prods_merge, on = 'user_id', indicator = True)

In [21]:
# check shape

df_merge.shape

(32404859, 34)

In [22]:
df_merge['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [23]:
df_merge.head()

,user_id,first_name,last_name,sex,state,age,date_joined,#_dependants,marital_status,income,...,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_prior_orders,order_frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Regularly busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Least busy days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [24]:
# check the outer join to see how many values dropped

df_merge_outer = df_cust.merge(ords_prods_merge, on = 'user_id', how = 'outer', indicator = True)

In [25]:
df_merge_outer['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [26]:
# export dataframe as pickle file

df_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))